# 판다스(Pandas)

In [2]:
import pandas as pd
import numpy as np

# 1. 시리즈(Series)

## 1) 생성 및 조회

<table>
    <thead>
        <tr>
            <th>이름</th><th>나이</th><th>키</th>
        </tr>
    </thead>
    <tbody>
        <tr><td>김영철</td><td>24</td><td>179.4</td></tr>
        <tr><td>송윤지</td><td>31</td><td>161.0</td></tr>
        <tr><td>임수현</td><td>26</td><td>174</td></tr>
    </tbody>
</table>

### (1) 데이터만 생성

In [5]:
name_data = pd.Series(data = ["김영철", "송윤지", "임수현"])
print(name_data)

age_data = pd.Series(data = [24, 31, 26])
print(age_data)

height_data = pd.Series(data = [179.4, 161.0, 174])
print(height_data)

0    김영철
1    송윤지
2    임수현
dtype: object
0    24
1    31
2    26
dtype: int64
0    179.4
1    161.0
2    174.0
dtype: float64

### (2) 인덱스와 함께 생성

<table>
    <thead>
        <tr>
            <th>이름</th><th>나이</th><th>키</th>
        </tr>
    </thead>
    <tbody>
        <tr><td>김영철</td><td>24</td><td>179.4</td></tr>
        <tr><td>송윤지</td><td>31</td><td>161.0</td></tr>
        <tr><td>임수현</td><td>26</td><td>174</td></tr>
    </tbody>
</table>

In [7]:
age_data = pd.Series(
    data = [24, 31, 26],
    index = ["김영철", "송윤지", "임수현"]
)

print(age_data)

김영철    24
송윤지    31
임수현    26
dtype: int64

In [10]:
print(age_data.index)
print(age_data.values)
print(type(age_data.index))
print(type(age_data.values))

Index(['김영철', '송윤지', '임수현'], dtype='object')
[24 31 26]
<class 'pandas.core.indexes.base.Index'>
<class 'numpy.ndarray'>

## 2) 연산

In [12]:
data1 = pd.Series(data = [10, 20, 30])
data2 = pd.Series(data = [1, 2, 3])

data3 = data1 ** data2
print(data3)

0       10
1      400
2    27000
dtype: int64

## 3) 결측치

### (1) 결측치 발생

In [14]:
data = pd.Series([1, np.nan])
print(data)

0    1.0
1    NaN
dtype: float64

In [15]:
data1 = pd.Series(data = [10, 20, 30])
data2 = pd.Series(data = [1, 2, 3, 4])

data3 = data1 + data2

print(data3)

0    11.0
1    22.0
2    33.0
3     NaN
dtype: float64

예제
* 데이터가 10, 20, 30인 시리즈 생성, 인덱스는 부산, 울산, 대구으로 설정
* 데이터가 1, 2, 3, 4인 시리즈 생성, 인덱스는 광주, 부산, 울산, 대구으로 설정
* 데이터의 덧셈

In [16]:
alpha_data = pd.Series(
    data = [10, 20, 30],
    index = ["부산", "울산", "대구"]
)
beta_data = pd.Series(
    data = [1, 2, 3, 4],
    index = ["광주", "부산", "울산", "대구"]
)

sum_data = alpha_data + beta_data
print(sum_data)

광주     NaN
대구    34.0
부산    12.0
울산    23.0
dtype: float64

### (2) 결측치 파악

In [17]:
sum_data.info()

<class 'pandas.core.series.Series'>
Index: 4 entries, 광주 to 울산
Series name: None
Non-Null Count  Dtype
--------------  -----
3 non-null      float64
dtypes: float64(1)
memory usage: 236.0+ bytes

In [76]:
# 결측치 판단하기

print(sum_data.isna())

print(sum(sum_data.isna()))

광주     True
대구    False
부산    False
울산    False
dtype: bool
1

### (3) 결측치 채우기

In [22]:
sum_data.fillna(0)

광주     0.0
대구    34.0
부산    12.0
울산    23.0
dtype: float64

### (4) 결측치 삭제

In [24]:
sum_data.dropna()

대구    34.0
부산    12.0
울산    23.0
dtype: float64

## 4) 통계

In [25]:
data = pd.Series(
    data = [10, 20, 30],
    index = ["부산", "울산", "대구"]
)

print(data.min())
print(data.mean())
print(data.var())
print(data.std())
print(data.max())

10
20.0
100.0
10.0
30

In [26]:
data.describe()

count     3.0
mean     20.0
std      10.0
min      10.0
25%      15.0
50%      20.0
75%      25.0
max      30.0
dtype: float64

예제. 문자 데이터

```
['HR', 'Engineering', 'HR', 'Engineering', 'HR', 'Marketing', 'Engineering', 'Marketing', 'HR']
```

In [27]:
data = pd.Series(
    data = ['HR', 'Engineering', 'HR', 'Engineering', 'HR', 'Marketing', 'Engineering', 'Marketing', 'HR']
)

data.describe()

count      9
unique     3
top       HR
freq       4
dtype: object

# 2. 데이터프레임(DataFrame)

## 1) 생성

<table>
    <thead>
        <tr>
            <th>이름</th><th>성별</th><th>나이</th><th>키</th>
        </tr>
    </thead>
    <tbody>
        <tr><td>김영철</td><th>M</th><td>24</td><td>179.4</td></tr>
        <tr><td>송윤지</td><th>F</th><td>31</td><td>161.0</td></tr>
        <tr><td>임수현</td><th>F</th><td>26</td><td>174</td></tr>
    </tbody>
</table>

In [68]:
data_list = [
    ["김영철", "M", 24, 179.4],
    ["송윤지", "F", 31, 161.0],
    ["임수현", "F", 26, 174]
]

data1 = pd.DataFrame(data_list)
data1.columns = ["이름", "성별", "나이", "키"]
data1

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

In [32]:
# 열 딕셔너리 이용

data_col_dict = {
    "이름" : ["김영철", "송윤지", "임수현"],
    "성별" : ["M", "F", "F"],
    "나이" : [24, 31, 26],
    "키" : [179.4, 161.0, 174]
}

data2 = pd.DataFrame(data_col_dict)
data2

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

In [34]:
# 행 딕셔너리 사용
data_row_list = [
    {"이름" : "김영철", "성별" : "M", "나이" : 24, "키": 179.4},
    {"이름" : "송윤지", "성별" : "F", "나이" : 31, "키": 161.0},
    {"이름" : "임수현", "성별" : "F", "나이" : 26, "키": 174}
]
data3 = pd.DataFrame(data_row_list)
data3

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

In [37]:
# 이름 열을 인덱스로 설정하기

data4 = data1.set_index("이름")
data4

    성별  나이      키
이름
김영철  M  24  179.4
송윤지  F  31  161.0
임수현  F  26  174.0

In [39]:
data5 = data4.reset_index()
data5

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

## 2) 조회

### (1) 이름으로 조회

In [40]:
data1

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

#### 열 조회

In [43]:
# 나이 열을 조회

data1["나이"]

0    24
1    31
2    26
Name: 나이, dtype: int64

In [44]:
# 나이, 키 열을 조회

data1[["나이", "키"]]

   나이      키
0  24  179.4
1  31  161.0
2  26  174.0

#### 행 조회

In [45]:
data4

    성별  나이      키
이름
김영철  M  24  179.4
송윤지  F  31  161.0
임수현  F  26  174.0

In [48]:
data4.loc["송윤지"]

성별        F
나이       31
키     161.0
Name: 송윤지, dtype: object

In [49]:
data4.loc[["김영철", "임수현"]]

    성별  나이      키
이름
김영철  M  24  179.4
임수현  F  26  174.0

#### 셀 조회

In [50]:
data4.loc["임수현", "키"]

np.float64(174.0)

### (2) 인덱스로 조회

In [51]:
data1

    이름 성별  나이      키
0  김영철  M  24  179.4
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

#### 열 조회

In [54]:
# 나이 열을 인덱스로 조회

data1.iloc[:,2]

0    24
1    31
2    26
Name: 나이, dtype: int64

In [55]:
# 성별, 키 열을 인덱스로 조회

data1.iloc[:,[1,3]]

  성별      키
0  M  179.4
1  F  161.0
2  F  174.0

#### 행 조회

In [56]:
# 송윤지 학생의 데이터를 인덱스로 조회

data1.iloc[1,:]

이름      송윤지
성별        F
나이       31
키     161.0
Name: 1, dtype: object

In [57]:
# 송윤지, 임수현 학생의 데이터를 인덱스로 조회

data1.iloc[[1, 2],:]

    이름 성별  나이      키
1  송윤지  F  31  161.0
2  임수현  F  26  174.0

#### 셀 조회

In [60]:
# 임수현 학생의 성별을 인덱스로 조회

data1.iloc[2, 1]

'F'

In [61]:
# 김영철 학생의 키를 인덱스로 조회

data1.iloc[0, 3]

np.float64(179.4)

### (3) 조건부 조회

In [70]:
# 성별이 M인 데이터 조회

data1.loc[(data1["성별"] == "M"), :]

    이름 성별  나이      키
0  김영철  M  24  179.4

In [71]:
# 키가 170이 넘는 사람들 조회

data1.loc[(data1["키"] > 170), :]

    이름 성별  나이      키
0  김영철  M  24  179.4
2  임수현  F  26  174.0

In [ ]:
# 성별이 F이면서 키가 170 이상인 사람 조회

data1.loc[
    (
        (data1["키"] >= 170) & (data1["성별"] == "F")
        ), :]

    이름 성별  나이      키
2  임수현  F  26  174.0

In [75]:
def get_gcd(num1, num2):
    return get_gcd(num2, num1 % num2) if num1 % num2 else num2


get_gcd(459, 63)

9

## 3) 편집

### (1) 인덱스 제거

### (2) 데이터 병합

### (3) 결측치 처리

## 4) 통계

# 3. 실습

## 예제 1.

## 예제 2.

## 예제 3. 자동차 회사의연비 데이터

* manufacturer : 회사명
* cty : 도심연비
* hwy : 고속도로 연비

## 데이터 불러오기

## 데이터 파악하기

## Q1. 몇 개의 회사 데이터가 있나요?

## Q2. 회사별로 참여한 자동차가 몇 대인지 파악하세요.

## Q3. 도심연비와 고속도로 연비를 평균낸 total 연비를 구하세요

## Q4. total 연비 상위 10개 회사의 회사별 개수를 구하세요

## +Quiz. 현대자동차의 평균 total 연비에 대한 평균값은?

## Q5. 평균 total 연비보다 높은 자동차는 PASS, 낮은 자동차는 FAIL로 구분하세요.

## +Quiz. PASS인 자동차 중 가장 많은 숫자의 자동차 회사는?